def fib_num_gen(n):
    f1, f2 = 1, 1
    for num in range(n):
        yield f1
        f1, f2 = f2, f1 + f2


print("Знайдемо значення числа з послідовності Фібоначчі за номером цього значення в послідовності, використовуючи генератор:")
user_n = int(input('Введіть номер елементу у послідовності Фібоначчі:\n'))
print(f"Елемент послідовності Фібоначчі за номером {user_n} має значення {list(fib_num_gen(user_n))[user_n-1]}\nЗнайдено використовуючи генератор")

print("Знайдемо значення числа з послідовності Фібоначчі за номером цього значення в послідовності, використовуючи рекурсію:")


def fib_num_recursion(n):
    if n in (1, 2):
        return 1
    return fib_num_recursion(n-1) + fib_num_recursion(n-2)


user_n = int(input('Введіть номер елементу у послідовності Фібоначчі:\n'))
print(f"Елемент послідовності Фібоначчі за номером {user_n} має значення {fib_num_recursion(user_n)}\nЗнайдено використовуючи рекурсію")


def fact_num_recursion(n):
    if n == 0:
        return 1
    return n * fact_num_recursion(n-1)


print("Порахуємо факторіал введеного числа використовуючи рекурсію")
print(f'Результат : {fact_num_recursion(int(input("Введіть ваше число для підрахунку його факторіала: ")))}')